{
	"welcome": "Üdvözöllek a portfólió oldalamon!",
	"common": {
		"buttonLabel": "Megtekintés",
		"excelLabel": "Excel fájl elérhetősége Google Drive-on"
	},
	"footer": {
		"description": "Kérdés, portfólió bekérés, önéletrajzbekérés esetén, kérem írjon egy e-mailt vagy keressen a megadott profilom egyikén!",
		"email": "roberta.csoti@gmail.com",
		"media_1": "Instagram",
		"media_2": "Facebook",
		"media_3": "LinkedIn",
		"town": "Szeged"
	},
	"profile": {
		"name": "Csóti Roberta",
		"work": "Jogi asszisztens | Menedzser asszisztens",
		"email": "roberta.csoti@gmail.com",
		"town": "Szeged",
		"about": "Rólam",
		"description": "Felsőfokú gazdasági menedzser-asszisztensként végeztem a Szegedi Tudományegyetem Gazdaságtudományi Karán. Jelenleg jogi asszisztensként dolgozom. Szenvedélyesen törekszem tudásom és készségeim folyamatos fejlesztésére. Számos nyelvtanfolyamon és adatelemzői workshopon vettem és veszek részt jelenleg is.",
		"certificateButton": "Tanúsítványok",
		"portfolioButton": "Portfóliok"
	},
	"language": {
		"title": "Nyelvi készségeim",
		"languages": [
			{"name": "Magyar", "description": "Anyanyelv"},
			{"name": "Német", "description": "Társalgási szint / B2 típusú szóbeli és írásbeli nyelvvizsga"},
			{"name": "Angol", "description": "Társalgási szint"},
			{"name": "Koreai", "description": "Koreai nyelvi kurzus, képesítés azonosítója: T/2023/000268-1. Jelenleg is tanulom, online kurzus formájában."},
			{"name": "Kínai", "description": "2024. október óta online nyelvi kurzuson veszek részt, hogy elsajátítsam a kínai nyelv alapjait"}
		]
	},
	"certificate": {
		"title": "Tanúsítványok",
		"excel_basics": {
			"title": "Excel alapozó",
			"subTitle": "Tanúsítvány száma: GMK 71200",
			"description": "Ezen a kurzuson megtanultam a mindennapi életben ma már elengedhetetlen excel alapismereteket (alapműveletek, Fkeres, Logikai függvények stb.)",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		},
		"excel_intermediate": {
			"title": "Excel középhaladó",
			"subTitle": "Tanúsítvány száma: GMK 94668",
			"description": "Elsajátítottam a statisztikai függvények, szövegkezelő függvények, dátum és idő fgv-ek, Adatérvényesítés módszerét, illetve Diagrammokat és Pivot-kimutatások használatát.",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		},
		"excel_expert": {
			"title": "Excel haladó",
			"subTitle": "Tanúsítvány száma: GMK 94334",
			"description": "Megtanultam a kurzuson az excel haladó funkcióit (irányított szűrés, fgv-ek egymásba ágyazása, Adatbázisfüggvények, INDEX, HOL.VAN fgv, Részösszegszámítás, Célérték keresés, Űrlapvezérlők)",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		},
		"excel_dashboard": {
			"title": "Dashboardok készítése Excelben",
			"subTitle": "Tanúsítvány száma: GMK 95549",
			"description": "Pivot-kimutatások segítségével megtanultam Dashboard (irányítópultot) létrehozni, kimutatásdiagrammok segítségével.",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		},
		"data_analyst_basic": {
			"title": "Data Analyst alapismeretek",
			"subTitle": "Tanúsítvány száma: GMK 96088",
			"description": "Szeret elemezni, információt gyorsan átadni, ezért fontosnak tartom, hogy jól válasszam meg a grafikont, amiben segítségemre volt ezt a kurzus.",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		},
		"data_visualization": {
			"title": "Adatvizualizáció",
			"subTitle": "Tanúsítvány száma: GMK 96175",
			"description": "Az adat elemző keresett szakma manapság, de nehéz eligazodni az ezernyi hirdetés között. Adat elemző lehet vizualizációs szakértő, üzleti elemző, SQL fejlesztő adat mérnök vagy akár Excel specialista is. Ebben a kurzusban átbeszéltük, melyik fogalom, mit is jelent pontosan.",
			"footer": "Felnőtképzési tevékenység nyilvántartásba vételi száma: B/2021/000560"
		}
	},
	"projectHistory": {
		"title": "Projekt előzmények",
		"image_1": "Adatok érvényessége",
		"subTitle_1": "Adatok érvényessége",
		"description_1": "A nyers adatok forrásának érvényessége és naprakészsége kulcsfontosságú a megbízható információk kinyeréséhez. Az érvényes adatok biztosítják, hogy valódi üzleti elemzések valósuljanak meg.",
		"image_2": "Tervezés",
		"subTitle_2": "Tervezés",
		"description_2": "A projekt megkezdése előtt fontos kérdések fogalmazódtak meg a megfelelő adatok és diagrammok kiválasztásáról, valamint a megjelenés megtervezéséről.",
		"description_3": "A Dashboard három fő munkalappal rendelkezik: Nyers adat réteg, Elemzés réteg és Prezentációs réteg – Dashboard. "
	},
	"portfolio": {
		"title": "Portfóliók",
		"workInProgress": "(Szerkesztés alatt)",
		"buttonLabel": "Megtekintés",
		"backButtonLabel": "Vissza",
		"autoDashboard": {
			"title": "Autós excel dashboard",
			"description": "Az autók eladásából keletkezett bevétel kimutatása",
			"phase_1": {
				"image_1": "Power Query",
				"title_1": "Adatok betöltése: Power Query",
				"description_1": "A projekt alapját egy 800 soros adatbázis képezte, amelyet a Power Query (Lekérdezésszerkesztő) segítségével töltöttem be.",
				"image_2": "Adatok",
				"title_2": "Tisztítás, oszlopok törlése",
				"description_2": "A betöltött adatbázisból eltávolítottam azokat az oszlopokat, amelyek nem voltak szükségesek a későbbi analízishez. Ez segít az adatok tisztábbá tételében és jobban fókuszálni a fontos információkra."
			},
			"phase_2": {
				"description_1": "Nyers adat réteg: forrástáblázat bemutatása ",
				"image_1": "Nyers adat réteg",
				"description_2": "A „Nyers adat réteg” munkalapon láthatjuk a forrást, amiból dolgoztam. Beállítottam, hogy új adat felvitelekor automatikusan frissüljön az Excel fájl. Ez a megoldás biztosítja, hogy a Dashboard mindig naprakész információkkal rendelkezzen, amely elengedhetetlen a megbízható döntéshozatalhoz.",
				"image_2": "Beállítások"
			},
			"phase_3": {
				"title": "Autósdashboard - Elemzés réteg",
				"description_1": "Ez a szekció bemutatja az adataink részletes elemzését, különös figyelmet fordítva a kimutatások készítésére és a pivot-táblázatok használatára.",
				"description_2": "A 2. munkalapon található az „Elemzés réteg”. Ez az a munkalap, ahol a betöltött adatokból információt nyerünk ki. Itt történnek a számítások, pivot-táblázatok (kimutatások), szűrési feltételek stb. Az én esetemben első példaként szerettem volna kimutatni, hogy ez adott évben, 2019 és 2022 között, havi bontásban, mennyi volt az autósboltnak a bevétele (nem profit!). ",
				"image": "Elemzés réteg"
			},
			"phase_4": {
				"title": "Kimutatások készítése: Pivot-táblázatok használata",
				"description_1": "A 2. kimutatásom az autó típusai szerint csoportosítja a bevételt.",
				"description_2": "A 3. Pivot-táblám azt mutatja, hogy mennyit adtak el az új és a használt gépjárművekből.",
				"description_3": "A 4. kimutatásnál az értékesítők munkáját mutatja ki. Összesen 2.13.941.000,- Ft értékben sikerült értékesíteniük átlagosan, ahol Jim teljesített legjobban, azonban ha szűrési feltételeket adunk meg (akár többet is), akkor ez a szám természetesen változhat.",
				"image_1": "Pivot tábla 1",
				"image_2": "Pivot tábla 2",
				"image_3": "Pivot tábla 3"
			},
			"phase_5": {
				"description": "Az. 5. kimutatás a Magyarország vármegyén belüli eladások alapján készült. Az alábbi képletre szükség volt, ha esetleg egy térképdiagrambanszerettem volna megjeleníteni (vagy akár a későbbiekben arra szeretném változtatni), akkor szükségünk van erre a függvényre. Atérképdiagram nem tud Pivot-táblázatból egyértelmű kimutatásdiagrammot létrehozni, ezért muszáj változtatnom rajta e függvénysegítségével (KIMUTATÁSADATOT.VESZ).",
				"image_1": "Pivot tábla 4",
				"image_2": "Függvény"
			},
			"phase_6": {
				"title": "Szeletelők",
				"image_1": "Excel elemzés",
				"description_1": "Miután elkészítettem a Pivot-táblázatokat, mindegyikhez szeletelőt szúrtam be a könnyebb szűrés érdekében. ",
				"image_2": "Kimutatáskapcsolatok",
				"description_2": "Ahhoz minden szűrési feltétel minden diagramra érvényes legyen, „Jelentéskapcsolatot” kellett létrehoznom, majd bepipáltam azokat, amikre szerettem volna, hogy változzon a diagram, ha rászűrök. Jelen esetben mindegyiket beválasztottam. "
			},
			"phase_7": {
				"title": "Prezentációs réteg - Dashboard",
				"description_1": "Fontos tudni, - ahogyan már korábban is említettem – az elemzés megkezdése előtt ezen a munkalapon már megterveztem a kinézetet, így az elkészült kimutatások diagrammjait már csak el kellett helyeznem a megfelelő helyre, méretre vágnom, szépítgetni, a megfelelő színeket kiválasztanom.",
				"description_2": "A Dashboard elkészítése során a cél egy világosan, áttekinthetően bemutatott információs rendszer kialakítása volt, amely lehetővé teszi a felhasználók számára a fontos adatok gyors megértését.",
				"description_3": "A diagrammok elhelyezése a Dashboardon kulcsfontosságú lépés a vizuális adatok bemutatásában. Az elkészült kimutatások diagramjait gondosan kell elhelyezni, hogy a felhasználók könnyen navigálhassanak közöttük és gyorsan értékelhessék az adatokat.",
				"subtitle_1": "Áttekinthetőség",
				"subtitle_2": "Diagrammok elhelyezése",
				"image": "Prezentációs réteg"
			},
			"phase_8": {
				"image_1": "Szűrők",
				"description_1": "Az alábbi szeletelők segítségével több szűrési feltételt megadhatunk.",
				"image_2": "További szűrők",
				"description_2": "Pl.: ha kiválasztjuk a 2022-es évet szűrési feltételként, akkor láthatjuk, hogy Johnny nevezetű értékesítő teljesített a legjobban, 2022. novemberében. Természetesen több szűrési feltételt is megadhatunk."
			}
		},
		"bicycleDashboard": {
			"title": "Bringa Dashboard",
			"description": "A biciklik és kellékeik eladásaiból keletkezett bevételek kimutatása",
			"phase_1": {
				"title": "Nyers adat réteg",
				"description": "Az alábbi portfólióm egy 60920 soros adatbázisból áll, amely a bicikli eladásokról szolgál különböző adatokat. A forrástáblázat most rendelkezésemre állt, azonban ha nem így lett volna, akkor a Power Query segítségével töltöttem volna be, illetve a szükséges adattisztításokat és naprakész frissítést állítottam volna."
			},
			"phase_2": {
				"title": "Elemzés réteg",
				"description": "Az „Elemzés réteg” , munkalapon számos kimutatást készítettem a Pivot-táblázat segítségével, ezeket pedig a „Prezentációs réteg” munkalapon jelenítettem meg vizuálisan különböző kimutatásdiagramokkal."
			},
			"phase_3": {
				"title": "Térképdiagram",
				"subtitle_1": "Térkép",
				"description_1": "Számomra a legérdekesebb rész a térkép diagram volt. Miután elkészültem a kimutatással (Region, Country, Purchase Price), átmásoltam ugyanezeket az adatokat a Purchase Price kivételével.",
				"subtitle_2": "KIMUTATÁSADATOT.VESZ függvény ",
				"description_2": "Helyette, egy függvényt használtam, a „KIMUTATÁSADATOT.VESZ”. Erre azért volt szükség, mert az egyszerű Pivot-táblából nem tud az excel térkép diagrammot létrehozni",
				"subtitle_3": "HAHIBA függvény ",
				"description_3": "A „HAHIBA” függvény segítségével pedig kiküszöböltem, hogyha hibakódot jelenítene meg az excel (pl. nincs adat a sorban), akkor egy 0-át jelenítsen meg a hibakód helyett."

			},
			"phase_4": {
				"description": "A térkép diagram azét is volt érdekes számomra, mert rendelkezésemre állt, hogy az egész világon mennyi az adott termékből való eladás, azonban én most csak a Kelet-Európai eladásokra szerettem volna nagyon hangsúlyt fektetni, ezért a Kelet-EU régiót és annak országait emeltem ki a térképen.",
				"image_1": "Nyers adatok 1",
				"image_2": "Nyers adatok 2",
				"image_3": "Térkép"
			},
			"phase_5": {
				"title": "Prezentációs réteg",
				"description": "Ha a Prezentációs rétegen tovább haladunk a diagramokkal, akkor azt láthatjuk, hogy egy adott év negyedéveiben (Q1, Q2,Q3,Q4), azon belül is havi bontásban, mennyi volt a biciklik eladása.",
				"image_1": "Elemzés réteg",
				"image_2": "Prezentációs réteg"
			},
			"phase_6": {
				"description": "Ha lefelé haladunk, akkor az alábbi kimutatás a biciklik szín szerinti eladásait mutatja.",
				"image_1": "Elemzés réteg",
				"image_2": "Prezentációs réteg"
			},
			"phase_7": {
				"description": "Balra mellette a TOP 10 vásárlót jeleníti meg.",
				"image_1": "Elemzés réteg",
				"image_2": "Prezentációs réteg"
			},
			"phase_8": {
				"description_1": "Az alábbi Pivot-tábla a termékek, illetve annak kategóriáinak, modelljeinek eladásából keletkezett bevételt mutatja.",
				"description_2": "Feltáteles formázással jelöltem azokat az adatokat, amelyeket hangsúlyozni szerettem volna.",
				"description_3": "Pl. Kék színnel jelöltem a legnagyobb bevételű termék összegét.",
				"image_1": "Pivot tábla"
			},
			"phase_9": {
				"title": "Szűrők",
				"subtitle": "Összességében a Dashboard-ok ezeket az információkat szolgálják.",
				"image": "Szűrő felület",
				"description": "Természetesen az alábbi szeletők segítségével szűrhetünk tovább, mint például az évre, negyedévre, hónapra és régiókra."
			}
		}
	}
}
